ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_mxotpc.c
/***************************************************************************//**
* \file cy_mxotpc.c
* \version 1.0
*
* Provides an API implementation of the OTP driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXS28OTPC)

#include "cy_mxotpc.h"
#include <stdlib.h>

/* Static Functions */
static cy_mxotpc_status_t Cy_MXOTPC_GetWriteProtectedData(uint32_t otpRowNum, uint32_t otpWriteData, uint32_t *otpWriteProtData);

/* Static Data types */
/** OTP Program Enable Sequence Data */
static uint8_t otpProgramEnable[] = { 0xf, 0x4, 0x8, 0xd};

/** \cond PARAM_CHECK_MACROS */
/** Parameter check macros */ 

#define CY_MXOTPC_IS_ROW_VALID(row)              (row < CY_MXOTPC_MAX_OTP_ROW)
#define CY_MXOTPC_IS_BITNUM_VALID(bit)           (bit < 32)
#define CY_MXOTPC_IS_DEST_ADDR_ALIGNED(addr)     (!((uint32_t)addr % 4u))
#define CY_MXOTPC_IS_ARRAY_SIZE_VALID(row, size) ((row+size) < CY_MXOTPC_MAX_OTP_ROW)
#define CY_MXOTPC_IS_SIZE_VALID(size)            (size != 0)
/** \endcond */

/*******************************************************************************
* Function Name: Cy_MXOTPC_Init
****************************************************************************//**
*
* Initializes the MXOTP Driver:
* - Enables the MXOTPC IP.
*
*  \param mxotpcConfig
*  This structure contains the data that needs to be filled in OTP_CTL register.
*
* Note - Allow NULL also, meaning OTP IP will go with default Configuration 
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_Init(cy_mxotpc_ctl_config_t const *mxotpcConfig)
{
    Cy_MXOTPC_IpEnable();

    if(mxotpcConfig != NULL)
        Cy_MXOTPC_OtpCtlConfig(mxotpcConfig);

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_DeInit
****************************************************************************//**
*
* DeInitializes the MXOTP Driver:
* - Disables the MXOTPC IP.
*
* Note - Allow NULL also, meaning OTP IP will go with default Configuration 
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_DeInit(void)
{
    Cy_MXOTPC_IpDisable();

    return CY_MXOTPC_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteProgramSequence
****************************************************************************//**
*
* Program Sequence for Writes
*
* 1.Write Following Bit
* OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control
* 2.Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* If this bit is not set, perform following steps, otherwise skip.
* a.OTP commands to enable OTP Programming 
* i.Write OTP_PROGDATA = 0xF
* ii.Write OTP_CMD reg (with CMD =0x02), VALUE:  0x9100_0000
* iii.Wait for OTP_CMD.START == 0
* iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
* Check whether programming is enabled or not
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteProgramSequence(void)
{
    uint32_t idx;
    cy_mxotpc_cmd_t otpCmd = {0, 0, 0};

    /* Check if programming is already enabled or not */
    if(!Cy_MXOTPC_OtpGetStatus(MXOTPC_OTP_STATUS_PROGOK_Msk))  
    {
        /* PROGRAM Sequence */
        /* 1.Write Following Bit
        * OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control */
        Cy_MXOTPC_OtpProgEnable(true);

        /* 2.Check whether OTP is busy or not
        * OTP_CMD.START == 0 // OTP is not busy */
        if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
            return CY_MXOTPC_TIMEOUT;

        /* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
        * OTP_STATUS.ProgOK == 1 // OTP programming enabled
        * If this bit is not set, perform following steps, otherwise skip.
        * a.OTP commands to enable OTP Programming.
        * i.Write OTP_PROGDATA = 0xF
        * ii.Write OTP_CMD reg (with CMD =0x02), VALUE:    0x9100_0000
        * iii.Wait for OTP_CMD.START == 0
        * iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
        * Check whether programming is enabled or not
        * OTP_STATUS.ProgOK == 1 // OTP programming enabled */
        for(idx = 0; idx < sizeof(otpProgramEnable); idx++)
        {
            Cy_MXOTPC_OtpSetProgData(otpProgramEnable[idx]);

            otpCmd.cmd = CY_MXOTPC_OTP_PROGENABLE_CMD;
            Cy_MXOTPC_OtpCmd(&otpCmd);

            if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
               return CY_MXOTPC_TIMEOUT;
        }
        if(!Cy_MXOTPC_OtpGetStatus(MXOTPC_OTP_STATUS_PROGOK_Msk))
            return CY_MXOTPC_WRITE_ERROR;
    }

    return CY_MXOTPC_SUCCESS;
}

