ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_mxotpc.c
/*******************************************************************************
* Function Name: Cy_MXOTPC_GetWriteProtectedData
****************************************************************************//**
*
* Write Protection for already set OTP bits
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param otpWriteData
*  Contains the Data to be written
*  \param otpFinalWriteData
*  Contains the corrected Data to be Written
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
static cy_mxotpc_status_t Cy_MXOTPC_GetWriteProtectedData(uint32_t otpRowNum, uint32_t otpWriteData, uint32_t *otpWriteProtData)
{
    uint32_t otpReadData;
    cy_mxotpc_status_t status;

    status = Cy_MXOTPC_ReadRow( otpRowNum, &otpReadData );
    if( !status )
    {
        *otpWriteProtData = (otpWriteData ^ otpReadData) & otpWriteData;
        return CY_MXOTPC_SUCCESS;
    }
    else
        return status;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteRowReadBack
****************************************************************************//**
*
* Writes a particular row with 32-bit data with/without ECC and reads the row back.
*
* Indirect PROGRAM Sequence
* 1.Write Following Bit
* OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control
* 2.Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* If this bit is not set, perform following steps, otherwise skip.
* a.OTP commands to enable OTP Programming
* i.Write OTP_PROGDATA = 0xF
* ii.Write OTP_CMD reg (with CMD =0x02), VALUE:  0x9100_0000
* iii.Wait for OTP_CMD.START == 0
* iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
* Check whether programming is enabled or not
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* 4.Write OTP_PROGDATA register
* Write 32-bit data value to be programmed inside OTP_PROGDATA reg
* 5.WRITE OTP_CMD Register
* Write following value in OTP_CMD reg.
* For OTP_CMD command (0x0A) at 511th row, you may use following value,
* 0x8501FF00
* 6.check completion of access
* Read 31st bit of OTP_CMD register to check completion of programming.
* OTP_CMD.START == 0 // access completed
* 7. Check programming status
* OTP_STATUS.PROGFAIL == 1 // Program failure
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param otpWriteData
*  Contains the Data to be written
*  \param otpReadBackData
*  Contains the Read back Data of the Row Number passed.
*  \param enable_ecc
*  Contains boolean, which tells to enable ECC for that row or not.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteRowReadBack(uint32_t otpRowNum, uint32_t otpWriteData, uint32_t *otpReadBackData, bool enable_ecc)
{
    cy_mxotpc_cmd_t otpCmd = {0, 0, 0};
    cy_mxotpc_status_t result = CY_MXOTPC_INVALID;
    uint32_t otpWriteProtData, otpReadData;

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));

    /* Indirect PROGRAM Sequence */
    result = Cy_MXOTPC_WriteProgramSequence();
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    /* 4.Write OTP_PROGDATA register
    * Write 32-bit data value to be programmed inside OTP_PROGDATA reg */
    /* Write Protection : OTP bit that is already set shouldnt be set again */
    result = Cy_MXOTPC_GetWriteProtectedData(otpRowNum, otpWriteData, &otpWriteProtData);
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    /* otpWriteProtData = 0 means required OTP's set already, Nothing to Write */
    if(otpWriteProtData)
    {
        Cy_MXOTPC_OtpSetProgData(otpWriteProtData);

        /* 5.WRITE OTP_CMD Register
        * Write following value in OTP_CMD reg.
        * For OTP_CMD command (0x0A) at 511th row, you may use following value,
        * 0x8501FF00 */
        if(enable_ecc)
            otpCmd.cmd = CY_MXOTPC_PROG_ECC_CMD;
        else
            otpCmd.cmd = CY_MXOTPC_PROG_CMD;

        otpCmd.rowAddr = otpRowNum;
        Cy_MXOTPC_OtpCmd(&otpCmd);

        /* 6.check completion of access
        * Read 31st bit of OTP_CMD register to check completion of programming.
        * OTP_CMD.START == 0 // access completed */
        if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
            return CY_MXOTPC_TIMEOUT;

        /* 7. Check programming status
        * OTP_STATUS.PROGFAIL == 1 // Program failure */
        if(Cy_MXOTPC_OtpGetStatus(MXOTPC_OTP_STATUS_PROGFAIL_Msk))  
            return CY_MXOTPC_WRITE_PROG_ERROR;

        /* Read the row back and verify if the data is written successfully */
        result = Cy_MXOTPC_ReadRow( otpRowNum, &otpReadData );
        if(result != CY_MXOTPC_SUCCESS)
            return result;
        
        if((otpReadData & otpWriteData) != otpWriteData)
            return CY_MXOTPC_WRITE_ERROR;
        
        /* Read back the Row Data and pass it back to caller for cross check */
        if( otpReadBackData )
            *otpReadBackData = otpReadData;
    }
    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteRow
****************************************************************************//**
*
* Writes a particular row with 32-bit data with/without ECC.
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param otpWriteData
*  Contains the Data to be written
*  \param enable_ecc
*  Contains boolean, which tells to enable ECC for that row or not.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteRow(uint32_t otpRowNum, uint32_t otpWriteData, bool enable_ecc)
{
    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));

    return Cy_MXOTPC_WriteRowReadBack(otpRowNum, otpWriteData, NULL, enable_ecc);
}

