ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_mxotpc.c
/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteBitReadBack
****************************************************************************//**
*
* Writes a particular row with 32-bit data without ECC and Read the Row back
*
* Indirect PROGRAM Sequence
* 1.Write Following Bit
* OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control
* 2.Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* If this bit is not set, perform following steps, otherwise skip.
* a.OTP commands to enable OTP Programming 
* i.Write OTP_PROGDATA = 0xF
* ii.Write OTP_CMD reg (with CMD =0x02), VALUE:  0x9100_0000
* iii.Wait for OTP_CMD.START == 0
* iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
* Check whether programming is enabled or not
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* 4.Write OTP_PROGDATA register after reading back and masking the
* required bit position, Write 32-bit data value to be programmed
* inside OTP_PROGDATA reg.
* 5.WRITE OTP_CMD Register
* Write following value in OTP_CMD reg.
* For OTP_CMD command (0x0A) at 511th row, you may use following value,
* 0x8501FF00
* 6.check completion of access
* Read 31st bit of OTP_CMD register to check completion of programming.
* OTP_CMD.START == 0 // access completed
* 7. Check programming status
* OTP_STATUS.PROGFAIL == 1 // Program failure
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param bitNum
*  Contains the bit position to be written
*  \param otpReadBackData
*  Contains the Read back Data of the Row Number passed.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteBitReadBack(uint32_t otpRowNum, uint32_t bitNum, uint32_t *otpReadBackData)
{
    cy_mxotpc_cmd_t otpCmd = {0, 0, 0};
    cy_mxotpc_status_t result = CY_MXOTPC_INVALID;
    uint32_t otpWriteProtData, otpReadData;

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_BITNUM_VALID(bitNum));

    /* Indirect PROGRAM Sequence */
    result = Cy_MXOTPC_WriteProgramSequence();
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    /* 4.Write OTP_PROGDATA register after reading back and masking the
    * required bit position, Write 32-bit data value to be programmed
    * inside OTP_PROGDATA reg */
    /* Write Protection : OTP bit that is already set shouldnt be set again */
    result = Cy_MXOTPC_GetWriteProtectedData(otpRowNum, (1 << bitNum), &otpWriteProtData);
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    /* otpWriteProtData = 0 means required OTP's set already, Nothing to Write */
    if(otpWriteProtData)
    {
        Cy_MXOTPC_OtpSetProgData(otpWriteProtData);

        /* 5.WRITE OTP_CMD Register
        * Write following value in OTP_CMD reg.
        * For OTP_CMD command (0x0A) at 511th row, you may use following value,
        * 0x8501FF00 */
        otpCmd.cmd = CY_MXOTPC_PROG_CMD;
        otpCmd.rowAddr = otpRowNum;
        Cy_MXOTPC_OtpCmd(&otpCmd);

        /* 6.check completion of access
        * Read 31st bit of OTP_CMD register to check completion of programming.
        * OTP_CMD.START == 0 // access completed */
        if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
            return CY_MXOTPC_TIMEOUT;

        /* 7. Check programming status
        * OTP_STATUS.PROGFAIL == 1 // Program failure */
        if(Cy_MXOTPC_OtpGetStatus(MXOTPC_OTP_STATUS_PROGFAIL_Msk))  
            return CY_MXOTPC_WRITE_ERROR;

    }
    
    /* Read the row back and verify if the data is written successfully */
    result = Cy_MXOTPC_ReadRow( otpRowNum, &otpReadData );
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    if(!(otpReadData & (1 << bitNum)))
        return CY_MXOTPC_WRITE_ERROR;

    /* Read back the Row Data and pass it back to caller for cross check */
    if(otpReadBackData)
        *otpReadBackData = otpReadData;
    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteBit
****************************************************************************//**
*
* Writes a particular row with 32-bit data without ECC
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param bitNum
*  Contains the bit position to be written
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteBit(uint32_t otpRowNum, uint32_t bitNum)
{
    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_BITNUM_VALID(bitNum));

    return Cy_MXOTPC_WriteBitReadBack(otpRowNum, bitNum, NULL);
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteEcc
****************************************************************************//**
*
* Writes a particular row with ECC.
*
* Indirect PROGRAM Sequence
* 1.Write Following Bit
* OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control
* 2.Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* If this bit is not set, perform following steps, otherwise skip.
* a.OTP commands to enable OTP Programming 
* i.Write OTP_PROGDATA = 0xF
* ii.Write OTP_CMD reg (with CMD =0x02), VALUE:  0x9100_0000
* iii.Wait for OTP_CMD.START == 0
* iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
* Check whether programming is enabled or not
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* 4.WRITE OTP_CMD Register
* Write following value in OTP_CMD reg.
* For OTP_CMD command (0x0A) at 511th row, you may use following value,
* 0x8401FF00
* 5.check completion of access
* Read 31st bit of OTP_CMD register to check completion of programming.
* OTP_CMD.START == 0 // access completed
* 6. Check programming status
* OTP_STATUS.PROGFAIL == 1 // Program failure
* 7. Read back the Row and check the ECC_STATUS register
* Check ECC_STATUS.ECC_ENABLE bits , if set then ECC_STATUS.ECC_DBL_ERR shouldnt
* be set.
*  \param otpRowNum
*  Contains the Row Number to be written with ECC
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteEcc(uint32_t otpRowNum)
{
    cy_mxotpc_cmd_t otpCmd = {0, 0, 0};
    uint32_t otpTempData;
    cy_mxotpc_status_t result = CY_MXOTPC_INVALID;

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));

    /* Indirect ECC PROGRAM Sequence */
    result = Cy_MXOTPC_WriteProgramSequence();
    if(result != CY_MXOTPC_SUCCESS)
        return result;

