ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_mxotpc.c
    /* 4.WRITE OTP_CMD Register
    * Write following value in OTP_CMD reg.
    * For OTP_CMD command (0x0A) at 511th row, you may use following value,
    * 0x8481FF00 */
    otpCmd.cmd = CY_MXOTPC_PROG_ECC_WREAD_CMD;
    otpCmd.rowAddr = otpRowNum;
    Cy_MXOTPC_OtpCmd(&otpCmd);

    /* 5.check completion of access
    * Read 31st bit of OTP_CMD register to check completion of programming.
    * OTP_CMD.START == 0 // access completed */
    if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
        return CY_MXOTPC_TIMEOUT;

    /* 6. Check programming status
    * OTP_STATUS.PROGFAIL == 1 // Program failure */
    if(Cy_MXOTPC_OtpGetStatus(MXOTPC_OTP_STATUS_PROGFAIL_Msk))  
        return CY_MXOTPC_WRITE_PROG_ERROR;

    /* Read the Row to check the ECC_STATUS */
    Cy_MXOTPC_ReadRow(otpRowNum, &otpTempData);

    if(!Cy_MXOTPC_OtpGetEccStatus(MXOTPC_ECC_STATUS_ECC_ENABLE_Msk))
        return CY_MXOTPC_WRITE_ECC_ERROR; 

    if(Cy_MXOTPC_OtpGetEccStatus(MXOTPC_ECC_STATUS_ECC_DBL_ERR_Msk))
        return CY_MXOTPC_WRITE_ECC_ERROR; 

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_ReadRow
****************************************************************************//**
*
*  Reads the 32-bit value of a particular Row
*
*  \param otpRowNum
*  Contains the Row Number to be read
*  \param otpReadData
*  Contains the Read Data of the Row Number passed.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_ReadRow(uint32_t otpRowNum, uint32_t *otpReadData)
{
    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));

    *otpReadData = CY_GET_REG32((CY_MXOTPC_BASE + MXOTPC_SECTION_SIZE) + (otpRowNum * 4));

    if(Cy_MXOTPC_OtpGetEccStatus(MXOTPC_ECC_STATUS_ECC_DBL_ERR_Msk))
        return CY_MXOTPC_READ_ECC_ERROR;

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_ReadBootRow
****************************************************************************//**
*
*  Reads the 32-bit value of Boot Row
*
*  \param otpReadData
*  Contains the Read Data of the Boot Row.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_ReadBootRow( uint32_t *otpReadData)
{
    *otpReadData = MXOTPC_BOOTROW;

    if(Cy_MXOTPC_OtpGetFoutEccStatus(MXOTPC_BOOT_ROW_FOUT_ECC_DED_STATUS_Msk))
        return CY_MXOTPC_READ_ECC_ERROR;

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_ReadBit
****************************************************************************//**
*
*  Reads a bit status of a particular OTP Row
*
*  \param otpRowNum
*  Contains the Row Number, whose bit status should be Read
*  \param bitNum
*  Contains the bit position to be Read
*  \param otpReadBit
*  Contains the Read bit of bitNum position from the Row Number passed.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_ReadBit(uint32_t otpRowNum, uint32_t bitNum, uint32_t *otpReadBit)
{

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_BITNUM_VALID(bitNum));

    *otpReadBit = CY_GET_REG32((CY_MXOTPC_BASE + MXOTPC_SECTION_SIZE) + (otpRowNum * 4));
    /* Get the value of position:bitNum */
    *otpReadBit = (*otpReadBit & (1 << bitNum)? 1 : 0) ;

    if(Cy_MXOTPC_OtpGetEccStatus(MXOTPC_ECC_STATUS_ECC_DBL_ERR_Msk))
        return CY_MXOTPC_READ_ECC_ERROR;

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_DirectWriteRow
****************************************************************************//**
*
* Writes a particular row with 32-bit data without ECC.
*
* Direct PROGRAM Sequence
* 1.Write Following Bit
* OTP_CTL.OTPProg_En =1 // Enable OTP programming at top level control
* 2.Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 3.Check whether programming is enabled or not (PROGRAM Enable Seq)
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* If this bit is not set, perform following steps, otherwise skip.
* a.OTP commands to enable OTP Programming 
* i.Write OTP_PROGDATA = 0xF
* ii.Write OTP_CMD reg (with CMD =0x02), VALUE:  0x9100_0000
* iii.Wait for OTP_CMD.START == 0
* iv.Repeat from point i to iii for OTP_PROGDATA 0x4, 0x8 and 0xd in sequence
* Check whether programming is enabled or not
* OTP_STATUS.ProgOK == 1 // OTP programming enabled
* 4.Write CPU_PROG_CMD register
* Write command (0x0A) for Direct write
* Write command (0x08) for Direct write with ECC
* 5.Directly write to the memory mapped OTP address
*
*  \param otpRowNum
*  Contains the Row Number to be written
*  \param otpWriteData
*  Contains the Data to be written
*  \param otpReadBackData
*  Contains the Read back Data of the Row Number passed.
*  \param otpProgEccEnable
*  Contains the data whether we have to enable ECC or not.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_DirectWriteRow(uint32_t otpRowNum, uint32_t otpWriteData, uint32_t *otpReadBackData, bool otpProgEccEnable)
{
    cy_mxotpc_status_t result = CY_MXOTPC_INVALID;
    uint32_t otpWriteProtData;

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));

    /* Indirect PROGRAM Sequence */
    result = Cy_MXOTPC_WriteProgramSequence();
    if(result != CY_MXOTPC_SUCCESS)
        return result;

    /* 4.Write CPU_PROG_CMD register
    * Write command (0x0A) for Direct write */
    if(otpProgEccEnable)
        Cy_MXOTPC_OtpCpuProgCmd(CY_MXOTPC_PROG_ECC_CMD);
    else
        Cy_MXOTPC_OtpCpuProgCmd(CY_MXOTPC_PROG_CMD);

    /* 5.Directly write to the memory mapped OTP address */
    /* Write Protection : OTP bit that is already set shouldnt be set again */
    result = Cy_MXOTPC_GetWriteProtectedData(otpRowNum, otpWriteData, &otpWriteProtData);
    if( result != CY_MXOTPC_SUCCESS )
        return result;

    /* otpWriteProtData = 0 means required OTP's set already, Nothing to Write */
    if(otpWriteProtData)
    {
        CY_SET_REG32((CY_MXOTPC_BASE + MXOTPC_SECTION_SIZE) + (otpRowNum * 4), otpWriteProtData);
    }

