ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_mxotpc.c
    /* Read back the Row Data and pass it back to caller for cross check */
    if(otpReadBackData)
        return Cy_MXOTPC_ReadRow(otpRowNum, otpReadBackData);

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_IndirectReadBit
****************************************************************************//**
*
*  Reads a bit status of a particular OTP Row using Indirect access
*
* Indirect READ Sequence
* 1.    Check whether OTP is busy or not
* OTP_CMD.START == 0 // OTP is not busy
* 2.    WRITE OTP_CMD Register
* Write following value in OTP_CMD reg.
* For READ command (0x00) at 15th row and 3rd bit, and clearing previous read error if exist, you may use following value,
* 0X9000_0F03
* 3.    check completion of access
* Read 31st bit of OTP_CMD register to check completion of programming.
* OTP_CMD.START == 0 // access completed
* 4.    Check Read status & Read bit
* OTP_CMD.ReadVal // Read value from specified bit.
* OTP_CMD.RD_ERR == 1 // Error in bit reading
* Read ECC_STATUS register for ECC status of the row. More details on ECC refer to register description.
*
*  \param otpRowNum
*  Contains the Row Number, whose bit status should be Read
*  \param bitNum
*  Contains the bit position to be Read
*  \param otpReadBit
*  Contains the Read bit of bitNum position from the Row Number passed.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_IndirectReadBit(uint32_t otpRowNum, uint32_t bitNum, uint32_t *otpReadBit)
{
    cy_mxotpc_cmd_t otpCmd = {0, 0, 0};

    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_BITNUM_VALID(bitNum));

    /* Indirect READ Sequence */
    /* 1.    Check whether OTP is busy or not
    * OTP_CMD.START == 0 // OTP is not busy */
    if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
        return CY_MXOTPC_READ_ERROR;

    /* 2.    WRITE OTP_CMD Register
    * Write following value in OTP_CMD reg.
    * For READ command (0x00) at 15th row and 3rd bit, and clearing previous read error if exist, you may use following value,
    * 0X9000_0F03 */
    otpCmd.cmd = CY_MXOTPC_READ_CMD;
    otpCmd.rowAddr = otpRowNum;
    otpCmd.colAddr = bitNum;
    Cy_MXOTPC_OtpCmd(&otpCmd);

    /* 3.    check completion of access
    * Read 31st bit of OTP_CMD register to check completion of programming.
    * OTP_CMD.START == 0 // access completed */
    if(Cy_MXOTPC_OtpCheckStartStatus(CY_START_STATUS_CHECK_TIMEOUT) == CY_MXOTPC_TIMEOUT)
        return CY_MXOTPC_READ_ERROR;

    /* 4.    Check Read status & Read bit
    * OTP_CMD.ReadVal // Read value from specified bit.
    * OTP_CMD.RD_ERR == 1 // Error in bit reading
    * Read ECC_STATUS register for ECC status of the row. More details on ECC refer to register description.*/
    if(Cy_MXOTPC_OtpGetReadBitStatus())
        return CY_MXOTPC_READ_ERROR;

    *otpReadBit = Cy_MXOTPC_OtpIndirectReadBit();

    if(Cy_MXOTPC_OtpGetEccStatus(MXOTPC_ECC_STATUS_ECC_DBL_ERR_Msk))
        return CY_MXOTPC_READ_ECC_ERROR;

    return CY_MXOTPC_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_ReadRowArray
****************************************************************************//**
*
*  Reads Array of Rows
*
*  \param otpRowNum
*  Contains the starting Row Number to be read
*  \param otpDstPointer
*  Contains the Destination Address where the data read has to be written back.
*  \param size
*  Contains the number of rows to be read from otpRowNum.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_ReadRowArray(uint32_t otpRowNum, uint32_t *otpDstPointer, uint32_t size)
{
    cy_mxotpc_status_t status = CY_MXOTPC_READ_ERROR;
    CY_ASSERT_L2(CY_MXOTPC_IS_SIZE_VALID(size));
    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_DEST_ADDR_ALIGNED(otpDstPointer));
    CY_ASSERT_L2(CY_MXOTPC_IS_ARRAY_SIZE_VALID(otpRowNum, size));

    while(size != 0)
    {
        status = Cy_MXOTPC_ReadRow( otpRowNum, otpDstPointer);
        if(status != CY_MXOTPC_SUCCESS)
            break;

        otpRowNum++;
        otpDstPointer++;
        size--;
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_MXOTPC_WriteRowArray
****************************************************************************//**
*
*  Writes Array of Rows
*
*  \param otpRowNum
*  Contains the starting Row Number to be written
*  \param otpSrcPointer
*  Contains the Destination Address where the data has to be read has to be written to rows.
*  \param size
*  Contains the number of rows to be written from otpRowNum.
*  \param enable_ecc
*  Contains boolean, which tells to enable ECC for that row or not.
*
*  \return the MXOTPC API status \ref cy_mxotpc_status_t.
*
*******************************************************************************/
cy_mxotpc_status_t Cy_MXOTPC_WriteRowArray(uint32_t otpRowNum, uint32_t *otpSrcPointer, uint32_t size, bool enable_ecc)
{
    cy_mxotpc_status_t status = CY_MXOTPC_WRITE_ERROR;
    CY_ASSERT_L2(CY_MXOTPC_IS_SIZE_VALID(size));
    CY_ASSERT_L2(CY_MXOTPC_IS_ROW_VALID(otpRowNum));
    CY_ASSERT_L2(CY_MXOTPC_IS_DEST_ADDR_ALIGNED(otpSrcPointer));
    CY_ASSERT_L2(CY_MXOTPC_IS_ARRAY_SIZE_VALID(otpRowNum, size));

    while(size != 0)
    {
        status = Cy_MXOTPC_WriteRow( otpRowNum, *otpSrcPointer, enable_ecc);
        if(status != CY_MXOTPC_SUCCESS)
            break;

        otpRowNum++;
        otpSrcPointer++;
        size--;
    }

    return status;
}

#endif /* CY_IP_MXS28OTPC */
/* [] END OF FILE */

